posts/2022-11-20-taking-on-emacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-11-20 Sun 23:15 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Taking on Emacs</title>
<meta name="author" content="Russell Brinson" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Taking on Emacs</h1>

<div id="outline-container-org1b3394d" class="outline-2">
<h2 id="org1b3394d"><span class="section-number-2">1.</span> Why the Change?</h2>
<div class="outline-text-2" id="text-1">
<p>
After toying with Haskell for a few days and really like the challenge (but mostly failing). I liked rediscovering this control over my computer experience. Please note, I'm saying rediscovered here and not saying that I couldn't do this with my existing knowledge of things like python or c, just simply me re-recongizing it was possible. Which then led me down the rabbit hole of how I interact with content and ultimately, what tools I use to do all of this.
</p>

<p>
One of the core take aways was how I interact with content:
</p>
<ol class="org-ol">
<li>I consume it, by reading or taking action on it</li>
<li>I take action on it, using math, or cutting and pasting</li>
<li>I format it, converting to PDF, exporting to the web</li>
</ol>

<p>
But when I interact with content in the form of a Microsoft Word Document, I need to juggle each of these aspects at the same time. It seemed to slow me know or side-track me on my goals and objectives, because I was fighting with one of the interactions of content that didn't matter more than the interaction that did.
</p>

<p>
Which led to me looking for new tools, in this case a haskell editor for literate programming. Emacs kept popping up which I rejected in the past. Then I kept seeing other trends in similar software and tools I was using (especially VS Code). Which led to me creating a personally specification that ultimately pointed to:
</p>
<ol class="org-ol">
<li>Learn Emacs</li>
<li>Use a plethora of open source solutions and custom write scripts that does the automation between them</li>
</ol>

<p>
Emacs won out, while it will take a while to become comfortable with it, I reached out to my local mastadon instance <a href="https://fosstodon.org/home">fosstodon</a> to ask about resources besides the default manual, to which I was directed to <a href="https://www.masteringemacs.org/article/beginners-guide-to-emacs">masteringemacs.org</a> that had some articles that helped drive home some confusing points with simple commands under those headings.  
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Russell Brinson</p>
<p class="date">Created: 2022-11-20 Sun 23:15</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
